{
  "backend/main.mo": "Main backend actor implementing access control, storage mixins, data types, and CRUD endpoints for users, submissions, payments, reference library, documents, and draft motions.",
  "backend/migration.mo": "Migration module converting old actor state into the expanded new state with reference library, case documents, and draft motions.",
  "feature_evidence.json": "Feature evidence report mapping required features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for documentation or build planning.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens, light/dark theme variables, and global styling rules.",
  "frontend/index.html": "HTML entry point with root mount node and script loading the React application.",
  "frontend/src/App.tsx": "Top-level React router configuration defining all routes, layouts, and new feature pages with auth gating.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a modal for new authenticated users to enter and save profile details using mutation hooks.",
  "frontend/src/components/auth/RequireAuth.tsx": "Protects children by showing a login-required message when the user is not authenticated.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding, navigation links, and a legal notice.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides the main header with navigation, logo, and login/logout handling including mobile menu support.",
  "frontend/src/components/stripe/PaymentSetup.tsx": "Shows an admin-only modal to configure Stripe secret key and allowed countries, saving settings via mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity login, logout, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, case submissions, payments, Stripe config, and checkout sessions using an actor API.",
  "frontend/src/index.css": "Tailwind CSS base file defining light/dark theme variables, global styles, and print-specific overrides.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard showing system payment setup and a table of all case submissions with status and details.",
  "frontend/src/pages/AdminReferenceLibraryPage.tsx": "Admin interface for adding and viewing legal reference library entries with form submission and access control.",
  "frontend/src/pages/CardCheckoutPage.tsx": "Stripe card payment page that creates a checkout session for a case submission and redirects the user to Stripe.",
  "frontend/src/pages/CaseSubmissionConfirmationPage.tsx": "Confirmation page displaying a submission ID, next steps, and navigation options after successful case submission.",
  "frontend/src/pages/CaseSubmissionPage.tsx": "Renders a case submission form requiring authentication, collects case details and payment method, and creates a case before navigating to confirmation.",
  "frontend/src/pages/CashAppInstructionsPage.tsx": "Displays Cash App payment instructions for a submission and allows users to submit their Cash App username as a payment reference.",
  "frontend/src/pages/CashAtStoreReceiptPage.tsx": "Generates a printable cash‑at‑store payment receipt with a payment code and lets users mark the payment as completed.",
  "frontend/src/pages/ContactDisclaimerPage.tsx": "Shows contact info, business hours, and a legal disclaimer stating the service is not legal advice or representation.",
  "frontend/src/pages/DraftMotionsPage.tsx": "Displays draft motions for a submission, handles loading/error states, and provides navigation to create new drafts.",
  "frontend/src/pages/DraftMotionWizardPage.tsx": "Provides a multi‑step wizard to draft and save a legal motion for a submission, including auto‑generated motion content.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero content, feature highlights, and calls to action for submitting a case or learning more.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the four-step process for using the service and provides guidance on what users should prepare.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Informs the user that a payment was cancelled and offers options to retry, check status, or return home.",
  "frontend/src/pages/PaymentsPage.tsx": "Shows available payment methods and routes users based on selection and submission ID.",
  "frontend/src/pages/PaymentStatusPage.tsx": "Allows users to look up a submission by ID and displays its status, including loading and error handling.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a confirmation screen after successful payment with next steps and navigation buttons.",
  "frontend/src/pages/PayPalInstructionsPage.tsx": "Shows PayPal payment instructions and lets users submit a transaction ID for their submission.",
  "frontend/src/pages/ReferenceLibraryPage.tsx": "Provides a searchable interface for legal reference entries with selectable detailed views.",
  "frontend/src/pages/ServicesPage.tsx": "Lists service offerings with descriptions and features plus a disclaimer about non-legal representation.",
  "frontend/src/pages/SubmissionDocumentsPage.tsx": "Allows users to upload and manage documents for a submission with validation and upload progress handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color variables, extended theme settings, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Defines the project’s state, features, architectural notes, and versioning for the Criminal Defence 305 platform focused on legal support and payment workflows."
}