{
  "backend/main.mo": "Main backend canister defining user profiles, case submissions, payment references, and Stripe checkout logic with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs for the project.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries for all frontend components and pages.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables, dark mode values, and base styling.",
  "frontend/index.html": "Base HTML document providing the root div and loading the React application.",
  "frontend/src/App.tsx": "Main React app defining layout and all routes for pages including submission, payment, and admin flows.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal requiring new authenticated users to complete name, email, and phone before using the app.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding, navigation links, and a legal notice.",
  "frontend/src/components/layout/SiteHeader.tsx": "Provides the site header with navigation, logo, and Internet Identity login/logout handling for desktop and mobile.",
  "frontend/src/components/stripe/PaymentSetup.tsx": "Admin-only dialog for configuring Stripe keys and allowed countries, with form validation and mutation handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods such as user profiles, cases, payments, and Stripe config.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, dark mode values, base styles, and print adjustments.",
  "frontend/src/main.tsx": "Entrypoint mounting the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Renders an admin dashboard showing all submissions, access control, payment setup, and status badges. Loads submissions and formats timestamps for display.",
  "frontend/src/pages/CardCheckoutPage.tsx": "Creates a Stripe checkout session for a submission and redirects the user to Stripe. Displays payment details and handles missing submission IDs.",
  "frontend/src/pages/CaseSubmissionConfirmationPage.tsx": "Shows a confirmation screen after a case is submitted, displaying the submission ID and next steps. Provides options to proceed to payment or check status later.",
  "frontend/src/pages/CaseSubmissionPage.tsx": "Allows authenticated users to submit case details and choose a payment method, then creates a case and redirects to confirmation. Validates input and handles errors.",
  "frontend/src/pages/CashAppInstructionsPage.tsx": "Displays Cash App payment instructions and collects the user's Cash App username for payment verification. Submits the reference and navigates to status tracking.",
  "frontend/src/pages/CashAtStoreReceiptPage.tsx": "Generates a store payment receipt with a payment code and allows users to mark payment as completed. Loads submission data and supports printing the receipt.",
  "frontend/src/pages/ContactDisclaimerPage.tsx": "Renders contact info, business hours, and a detailed legal disclaimer using card components.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage layout with a hero section, feature highlights, and navigation CTAs.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays a four-step explanation of the service process with cards and a final CTA to submit a case.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment cancellation notice with options to retry, check status, or return home.",
  "frontend/src/pages/PaymentsPage.tsx": "Provides selectable payment methods and routes users based on chosen method and submission ID.",
  "frontend/src/pages/PaymentStatusPage.tsx": "Allows users to look up case status by submission ID and displays status details with badges.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a confirmation screen after successful payment with next steps and navigation buttons.",
  "frontend/src/pages/PayPalInstructionsPage.tsx": "Guides users through PayPal payment steps and submits a transaction ID tied to a submission ID.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a list of service offerings with descriptions and features plus an important legal notice.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the project's styling system.",
  "project_state.json": "Defines the project’s state, features, requirements, and branding details for Criminal Defence 305."
}