{
  "kind": "build_request",
  "title": "Add legal document support, reference library, and motion drafting assistance tied to case submissions",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add backend data models and actor methods to store and retrieve (a) user-uploaded legal documents tied to a case submission and (b) generated draft motion documents tied to a case submission, with ownership checks (user can only access their own items; admin can access all).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-10"
        ],
        "quotes": [
          "I want this app to support legal documents and ensure the rules are being followed if not it creates the motions for the client",
          "...find out what it is that the courts did wrong to free my defendants."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes methods to create/list/get/delete legal documents for a given submission ID with authorization enforcement consistent with existing submission ownership rules.",
        "Backend exposes methods to create/list/get draft motions for a given submission ID with the same authorization rules.",
        "Attempting to access another user’s documents/motions as a non-admin traps/returns an authorization error consistent with existing patterns."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Implement a backend-managed reference library feature that allows admins to add, update, list, and delete reference entries (text and metadata), and allows authenticated users to search/browse and view reference entries in-app.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "All of them, all criminal law, it has to be backed by the constitution, due process, and all criminal law books need to be there for the app to look through it"
        ]
      },
      "acceptanceCriteria": [
        "Admin-only backend methods exist to CRUD reference entries (title + body text + optional tags/source fields).",
        "User-accessible backend methods exist to list/search reference entries without exposing admin-only operations.",
        "Frontend includes a Reference Library page where users can search and read entries; content is loaded via React Query hooks.",
        "Frontend includes an Admin UI section/page to manage reference entries (create/edit/delete) gated behind existing admin checks."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Add a guided “Draft Motion” flow that lets a user select a case submission, pick a motion template, fill in required fields, optionally select relevant reference-library entries, and then generates a draft motion document (text output) saved to the backend under that submission.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-12"
        ],
        "quotes": [
          "...it creates the motions for the client",
          "3"
        ]
      },
      "acceptanceCriteria": [
        "Backend supports admin-managed motion templates (template name + template body with placeholders + required field definitions).",
        "Frontend provides a Draft Motion wizard that: selects submission ID, selects a template, collects field inputs, previews generated text, and saves the final draft motion to the backend.",
        "Generated drafts are persisted and can be re-opened from a per-submission list view for the authenticated user.",
        "All user-facing screens include clear English-language disclaimer text stating drafts are informational and must be reviewed by a qualified attorney before filing."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add frontend UI to upload and manage legal documents for a submission (metadata + file content stored as text or base64 where feasible), including listing documents, viewing a document, and deleting a document, with clear size/type limits communicated to the user.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I want this app to support legal documents"
        ]
      },
      "acceptanceCriteria": [
        "A user can attach at least one document to a submission, see it listed under that submission, open/view it, and delete it.",
        "UI communicates allowed file types and a maximum file size limit before upload/submit.",
        "Uploads and downloads are gated by authentication and submission ownership checks."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add navigation and routing to expose the new features: Reference Library, Submission Documents, and Draft Motions, without breaking existing case submission and payment flows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-16"
        ],
        "quotes": [
          "I want this app to support legal documents...",
          "I want it started asap"
        ]
      },
      "acceptanceCriteria": [
        "New routes are added to the app router and are reachable from existing navigation (header or relevant pages).",
        "Existing routes (case submission, payments, admin) continue to function as before.",
        "Unauthorized users are prompted to log in (Internet Identity) before accessing library/documents/drafting pages."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); only add migration code if an upgrade requires state migration.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths; compose existing UI components instead.",
    "Use English for all user-facing text.",
    "Do not integrate external AI/LLM services; motion drafting must be template/form-based using user input and stored reference text only."
  ],
  "nonGoals": [
    "Providing or bundling “all criminal law books” or a complete U.S. legal corpus by default (the library must be admin-entered/uploaded content only).",
    "Automated legal determinations that guarantee identifying court errors or “freeing defendants.”",
    "E-filing, court API integrations, or real-time messaging/chat."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}