{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend UI for reference library, submission documents, and draft motion flow",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Add Reference Library browsing/search for users and an admin management UI, wired to backend via React Query hooks",
      "acceptanceCriteria": [
        "Frontend includes a Reference Library page where users can search and read entries; content is loaded via React Query hooks.",
        "Frontend includes an Admin UI section/page to manage reference entries (create/edit/delete) gated behind existing admin checks."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update TypeScript backend interface typings to include any new/expanded reference-library operations required by the UI (admin create/edit/delete + user browse/search/get)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for reference library operations (user search/list/get entry; admin create/update/delete). Ensure queries are disabled until an actor is available and errors are surfaced for authorization failures."
        },
        {
          "path": "frontend/src/pages/ReferenceLibraryPage.tsx",
          "operation": "create",
          "description": "Create a user-facing Reference Library page with search input and readable entry view (list + detail). Load data via the new React Query hooks and show empty/loading/error states. Use existing shadcn-ui composed components (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminReferenceLibraryPage.tsx",
          "operation": "create",
          "description": "Create an admin-only Reference Library management page supporting create/edit/delete of entries. Gate access using the existing admin check hook and show an Access Denied card when unauthorized. Use existing shadcn-ui composed components (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register new routes for the Reference Library and admin management page (e.g., /reference-library and /admin/reference-library) and ensure they render within the existing Layout without breaking existing submission/payment/admin routes."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Add navigation links to the new Reference Library route. Keep existing navigation intact and ensure links work for both desktop and mobile menus."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add a guided Draft Motion wizard tied to a submission, supporting template selection, field entry, preview, reference selection, saving, and per-submission draft listing with disclaimers",
      "acceptanceCriteria": [
        "Frontend provides a Draft Motion wizard that: selects submission ID, selects a template, collects field inputs, previews generated text, and saves the final draft motion to the backend.",
        "Generated drafts are persisted and can be re-opened from a per-submission list view for the authenticated user.",
        "All user-facing screens include clear English-language disclaimer text stating drafts are informational and must be reviewed by a qualified attorney before filing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend typings to support motion template reading/admin management (as needed by the wizard) and any additional draft-motion operations needed to list/get drafts for a submission."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for draft motions (list by submission, create/save) and motion templates (list/get; admin CRUD if required by the UI). Ensure cache keys are scoped by submission ID and template ID as appropriate."
        },
        {
          "path": "frontend/src/pages/DraftMotionsPage.tsx",
          "operation": "create",
          "description": "Create a per-submission Draft Motions page that lists saved drafts for a given submission and provides an action to start the Draft Motion wizard. Include prominent English disclaimer text about attorney review before filing. Use existing shadcn-ui composed components; do not edit frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DraftMotionWizardPage.tsx",
          "operation": "create",
          "description": "Create a Draft Motion wizard page that supports: selecting/confirming a submission ID, selecting a template, collecting required field inputs, optionally selecting relevant reference entries, generating a preview (template placeholder replacement), and saving to backend. Include prominent English disclaimer text. Use existing shadcn-ui composed components; do not edit frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminMotionTemplatesPage.tsx",
          "operation": "create",
          "description": "Create an admin-only page to manage motion templates (create/edit/delete), gated via the existing admin check. Keep template-based drafting purely form/template-driven (no external AI). Use existing shadcn-ui composed components; do not edit frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add routes for draft motions and the wizard (e.g., /submissions/:submissionId/draft-motions and /submissions/:submissionId/draft-motions/new) and an admin route for templates (e.g., /admin/motion-templates). Ensure routes integrate with the existing router setup."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Add UI to upload, list, view, and delete submission documents with clear file size/type limits and ownership/auth gating",
      "acceptanceCriteria": [
        "A user can attach at least one document to a submission, see it listed under that submission, open/view it, and delete it.",
        "UI communicates allowed file types and a maximum file size limit before upload/submit.",
        "Uploads and downloads are gated by authentication and submission ownership checks."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update typings to include any document-management methods required by the UI (upload/list/get/delete) and ensure CaseDocument/DocumentType/ExternalBlob typings are usable in the document screens."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for submission documents (list by submission, get/view, upload, delete). Use the blob-storage ExternalBlob type for file upload/download handling and optional upload progress. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SubmissionDocumentsPage.tsx",
          "operation": "create",
          "description": "Create a per-submission Documents page that supports: displaying allowed file types and max size, uploading (file picker + metadata/document type), listing documents, viewing a document (using ExternalBlob direct URL or bytes where appropriate), and deleting documents with confirmation. Handle authorization errors gracefully and require authentication before interacting. Use existing shadcn-ui composed components; do not edit frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a route for per-submission documents (e.g., /submissions/:submissionId/documents) and ensure it is reachable and does not interfere with existing payment/submission flows."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Wire navigation/routing for Reference Library, Submission Documents, and Draft Motions with login prompts and without breaking existing flows",
      "acceptanceCriteria": [
        "New routes are added to the app router and are reachable from existing navigation (header or relevant pages).",
        "Existing routes (case submission, payments, admin) continue to function as before.",
        "Unauthorized users are prompted to log in (Internet Identity) before accessing library/documents/drafting pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/RequireAuth.tsx",
          "operation": "create",
          "description": "Create a small auth-gate wrapper that checks Internet Identity state and renders a clear English login prompt (and/or link to use the existing header Login button) when unauthenticated; otherwise renders children."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the new feature pages (Reference Library, Submission Documents, Draft Motions, Draft Motion Wizard) with the auth-gate so guests see a login prompt before content loads. Ensure existing routes remain unchanged and continue working."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Expose navigation entry points to the new user-facing features (at least Reference Library) while keeping current links and login/logout behavior intact."
        },
        {
          "path": "frontend/src/pages/CaseSubmissionConfirmationPage.tsx",
          "operation": "modify",
          "description": "Add clear in-context links/buttons from the submission confirmation screen to the new per-submission Documents and Draft Motions pages using the created submission ID, without altering the existing payment CTAs/flow."
        },
        {
          "path": "frontend/src/pages/PaymentStatusPage.tsx",
          "operation": "modify",
          "description": "Add optional links/actions from the status view (when a submission ID is present) to the per-submission Documents and Draft Motions pages, ensuring the existing status lookup continues to function."
        }
      ]
    }
  ]
}